### **Header Creation**

In [110]:
import openpyxl
from openpyxl.styles import Font, Alignment, Border, Side
from datetime import datetime

# Create a new workbook and select the active sheet
wb = openpyxl.Workbook()
ws = wb.active
ws.title = "Fee Details"

# Set the width for columns
column_widths = [5, 45, 15, 15, 11, 11, 11, 11, 10, 11, 11, 15, 10, 15]
for i, width in enumerate(column_widths, start=1):
    ws.column_dimensions[openpyxl.utils.get_column_letter(i)].width = width

# Define bold border style
bold_border = Border(left=Side(style='thick'), 
                     right=Side(style='thick'), 
                     top=Side(style='thick'), 
                     bottom=Side(style='thick'))

# Define thin border style for table cells
thin_border = Border(left=Side(style='thin'), 
                     right=Side(style='thin'), 
                     top=Side(style='thin'), 
                     bottom=Side(style='thin'))

# Merge cells to create the title
ws.merge_cells('A1:N1')
ws['A1'] = "KOTAK SALESIAN SCHOOL"
ws['A1'].font = Font(size=14, bold=True)
ws['A1'].alignment = Alignment(horizontal='center', vertical='center')
ws['A1'].border = bold_border  # Apply bold border to the title

# Merge cells to create the subtitle
ws.merge_cells('A2:N2')
ws['A2'] = "SCHOOL FEE DETAILS 2024-2025"
ws['A2'].font = Font(size=12, bold=True)
ws['A2'].alignment = Alignment(horizontal='center', vertical='center')
ws['A2'].border = bold_border  # Apply bold border to the subtitle

# Get today's date and format it
today_date = datetime.today().strftime('%d-%m-%y')
ws.merge_cells('M3:N3')  # Merge M and N for the date
ws['M3'] = f"Date: {today_date}"
ws['M3'].alignment = Alignment(horizontal='center')
ws['M3'].border = bold_border  # Apply bold border to the date

# Merge cells in the third row from A to L for headers
ws.merge_cells('A3:L3')
ws['A3'] = " "  # Leave this merged cell empty to keep the layout clean
ws['A3'].alignment = Alignment(horizontal='center')
ws['A3'].border = bold_border  # Apply bold border to the merged cells

# Create the column headers
headers = ["S.No", "STUDENT NAME", "ADMISSION NO", "CLASS & SEC", 
           "1st Term JUNE - AUG", "2nd Term SEPT - NOV", 
           "3rd Term DEC - FEB", "4th Term MAR - MAY", 
           "Total Fee Paid", "Discount / Concession", 
           "Total Fee Due", "Permission upto", "Fine", "Payment Status"]

for col, header in enumerate(headers, start=1):
    ws.cell(row=4, column=col, value=header)
    ws.cell(row=4, column=col).font = Font(bold=True)
    ws.cell(row=4, column=col).alignment = Alignment(horizontal='center', vertical='center', wrap_text=True)
    ws.cell(row=4, column=col).border = bold_border  # Apply bold borders to headers

# Apply bold borders to all header cells in the first three rows
for row in [1, 2, 3]:
    for col in range(1, 15):  # Columns A to N
        ws.cell(row=row, column=col).border = bold_border

# Save the workbook to the specified directory
wb.save(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\fee_details_header.xlsx")

### **Table Creation**

In [111]:
import pandas as pd

# Read the Excel file and trim rows
df = pd.read_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\PythonScript\FeesReport2024-25.xlsx")[2:-55]

# Set the second row as the header
df = df.iloc[:, :-1]
new_header = df.iloc[1]  # Get the second row for the header
df = df[2:]  # Take the data from the third row onward
df.columns = new_header  # Set the new header
df.reset_index(drop=True, inplace=True)  # Reset index

# Display the DataFrame
df

3,S.No.,Admin No.,Name,Abacus / Vediic Maths,TERM FEE,Total Fee Mapped,Abacus / Vediic Maths,TERM FEE,Total Fee Paid,Total Discount,Total Due
0,1,16922,BHASHVIKA AKULA,0,24200,24200,0,12100,12100,0,12100
1,2,17103,BHAVITHA SRI PANDRANKI,0,24200,24200,0,6050,6050,0,18150
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,0,24200,24200,0,12100,12100,0,12100
3,4,16938,JESWIKA RAGHUMANDA,0,24200,24200,0,12100,12100,0,12100
4,5,16932,MANASVEE DEVIREDDY,0,24200,24200,0,12100,12100,0,12100
...,...,...,...,...,...,...,...,...,...,...,...
1880,46,15872,SHANMUKH SALAPU,0,41800,41800,0,31350,31350,0,10450
1881,47,15741,SIVA HARSHA VELAMAREDDI,0,41800,41800,0,20900,20900,0,20900
1882,48,13863,UPENDRA MUTCHI,0,41800,41800,0,10450,10450,0,31350
1883,49,14360,VARUN PRESINGI,0,41800,41800,0,10450,10450,0,31350
1884,50,13796,VINAY PIDUGU,0,41800,41800,0,10450,10450,0,31350

In [112]:
df.columns

Index(['S.No.', 'Admin No.', 'Name', 'Abacus / Vediic Maths', 'TERM FEE',
       'Total Fee Mapped', 'Abacus / Vediic Maths', 'TERM FEE',
       'Total Fee Paid', 'Total Discount', 'Total Due'],
      dtype='object', name=3)

In [113]:
# Drop rows where 'S.No.' column contains 'S.No.'
df = df[df['S.No.'] != 'S.No.']

df = df[df['S.No.'] != 'Total']

# Reset index after dropping rows
df.reset_index(drop=True, inplace=True)

df

3,S.No.,Admin No.,Name,Abacus / Vediic Maths,TERM FEE,Total Fee Mapped,Abacus / Vediic Maths,TERM FEE,Total Fee Paid,Total Discount,Total Due
0,1,16922,BHASHVIKA AKULA,0,24200,24200,0,12100,12100,0,12100
1,2,17103,BHAVITHA SRI PANDRANKI,0,24200,24200,0,6050,6050,0,18150
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,0,24200,24200,0,12100,12100,0,12100
3,4,16938,JESWIKA RAGHUMANDA,0,24200,24200,0,12100,12100,0,12100
4,5,16932,MANASVEE DEVIREDDY,0,24200,24200,0,12100,12100,0,12100
...,...,...,...,...,...,...,...,...,...,...,...
1798,46,15872,SHANMUKH SALAPU,0,41800,41800,0,31350,31350,0,10450
1799,47,15741,SIVA HARSHA VELAMAREDDI,0,41800,41800,0,20900,20900,0,20900
1800,48,13863,UPENDRA MUTCHI,0,41800,41800,0,10450,10450,0,31350
1801,49,14360,VARUN PRESINGI,0,41800,41800,0,10450,10450,0,31350
1802,50,13796,VINAY PIDUGU,0,41800,41800,0,10450,10450,0,31350

In [114]:
df.isnull().sum()

3
S.No.                    41
Admin No.                82
Name                     82
Abacus / Vediic Maths    82
TERM FEE                 82
Total Fee Mapped         82
Abacus / Vediic Maths    82
TERM FEE                 82
Total Fee Paid           82
Total Discount           82
Total Due                82
dtype: int64

In [115]:
df = df.drop(columns=['Abacus / Vediic Maths', 'TERM FEE',  'Abacus / Vediic Maths', 'TERM FEE' ])

In [116]:
df.head()

3,S.No.,Admin No.,Name,Total Fee Mapped,Total Fee Paid,Total Discount,Total Due
0,1,16922,BHASHVIKA AKULA,24200,12100,0,12100
1,2,17103,BHAVITHA SRI PANDRANKI,24200,6050,0,18150
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,24200,12100,0,12100
3,4,16938,JESWIKA RAGHUMANDA,24200,12100,0,12100
4,5,16932,MANASVEE DEVIREDDY,24200,12100,0,12100

In [117]:
df = df.dropna(how='all', subset=['S.No.'])

In [118]:
df[df["S.No."].isnull()]

Empty DataFrame
Columns: [S.No., Admin No., Name, Total Fee Mapped, Total Fee Paid, Total Discount, Total Due]
Index: []

In [119]:
# List of class/section indicators to check for
class_indicators = ["LKG", "UKG", "Pre KG", "I", "II", "III", "IV", "V", "VI", "VII", "VIII", "IX", "X"]

# Assign class/section values to 'Class & Sec' column based on 'S.No.'
current_class_sec = None

for index, row in df.iterrows():
    # Check if the 'S.No.' value contains any class/section indicator
    if isinstance(row['S.No.'], str) and any(indicator in row['S.No.'] for indicator in class_indicators):
        # Assign the entire S.No. string to 'Class & Sec'
        current_class_sec = row['S.No.']

    # Assign the current class/section to the new column
    df.at[index, 'Class & Sec'] = current_class_sec

# Display the modified DataFrame
df

3,S.No.,Admin No.,Name,Total Fee Mapped,Total Fee Paid,Total Discount,Total Due,Class & Sec
0,1,16922,BHASHVIKA AKULA,24200,12100,0,12100,None
1,2,17103,BHAVITHA SRI PANDRANKI,24200,6050,0,18150,None
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,24200,12100,0,12100,None
3,4,16938,JESWIKA RAGHUMANDA,24200,12100,0,12100,None
4,5,16932,MANASVEE DEVIREDDY,24200,12100,0,12100,None
...,...,...,...,...,...,...,...,...
1798,46,15872,SHANMUKH SALAPU,41800,31350,0,10450,X - C
1799,47,15741,SIVA HARSHA VELAMAREDDI,41800,20900,0,20900,X - C
1800,48,13863,UPENDRA MUTCHI,41800,10450,0,31350,X - C
1801,49,14360,VARUN PRESINGI,41800,10450,0,31350,X - C
1802,50,13796,VINAY PIDUGU,41800,10450,0,31350,X - C

In [120]:
df["Class & Sec"] = df["Class & Sec"].fillna("LKG - A")

In [121]:
df

3,S.No.,Admin No.,Name,Total Fee Mapped,Total Fee Paid,Total Discount,Total Due,Class & Sec
0,1,16922,BHASHVIKA AKULA,24200,12100,0,12100,LKG - A
1,2,17103,BHAVITHA SRI PANDRANKI,24200,6050,0,18150,LKG - A
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,24200,12100,0,12100,LKG - A
3,4,16938,JESWIKA RAGHUMANDA,24200,12100,0,12100,LKG - A
4,5,16932,MANASVEE DEVIREDDY,24200,12100,0,12100,LKG - A
...,...,...,...,...,...,...,...,...
1798,46,15872,SHANMUKH SALAPU,41800,31350,0,10450,X - C
1799,47,15741,SIVA HARSHA VELAMAREDDI,41800,20900,0,20900,X - C
1800,48,13863,UPENDRA MUTCHI,41800,10450,0,31350,X - C
1801,49,14360,VARUN PRESINGI,41800,10450,0,31350,X - C
1802,50,13796,VINAY PIDUGU,41800,10450,0,31350,X - C

In [122]:
df.isnull().sum()

3
S.No.                0
Admin No.           41
Name                41
Total Fee Mapped    41
Total Fee Paid      41
Total Discount      41
Total Due           41
Class & Sec          0
dtype: int64

In [123]:
df = df.dropna(how='all', subset=['Admin No.'])

# Reset index after dropping rows
df.reset_index(drop=True, inplace=True)

df

3,S.No.,Admin No.,Name,Total Fee Mapped,Total Fee Paid,Total Discount,Total Due,Class & Sec
0,1,16922,BHASHVIKA AKULA,24200,12100,0,12100,LKG - A
1,2,17103,BHAVITHA SRI PANDRANKI,24200,6050,0,18150,LKG - A
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,24200,12100,0,12100,LKG - A
3,4,16938,JESWIKA RAGHUMANDA,24200,12100,0,12100,LKG - A
4,5,16932,MANASVEE DEVIREDDY,24200,12100,0,12100,LKG - A
...,...,...,...,...,...,...,...,...
1716,46,15872,SHANMUKH SALAPU,41800,31350,0,10450,X - C
1717,47,15741,SIVA HARSHA VELAMAREDDI,41800,20900,0,20900,X - C
1718,48,13863,UPENDRA MUTCHI,41800,10450,0,31350,X - C
1719,49,14360,VARUN PRESINGI,41800,10450,0,31350,X - C
1720,50,13796,VINAY PIDUGU,41800,10450,0,31350,X - C

In [124]:
df.columns

Index(['S.No.', 'Admin No.', 'Name', 'Total Fee Mapped', 'Total Fee Paid',
       'Total Discount', 'Total Due', 'Class & Sec'],
      dtype='object', name=3)

In [125]:
df.columns= ['SNo', 'AdmissionNo', 'StudentName', 'TotalFees', 'TotalFeePaid','Discount/Concession', 'TotalDue', 'Class & Sec']

In [126]:
# Reorder the DataFrame to the specified column order
try:
    df = df[['SNo', 'AdmissionNo', 'StudentName', 'Class & Sec', 'TotalFees', 'TotalFeePaid', 'Discount/Concession', 'TotalDue']]
except KeyError as e:
    print(f"Error: {e}")

In [127]:
df

,SNo,AdmissionNo,StudentName,Class & Sec,TotalFees,TotalFeePaid,Discount/Concession,TotalDue
0,1,16922,BHASHVIKA AKULA,LKG - A,24200,12100,0,12100
1,2,17103,BHAVITHA SRI PANDRANKI,LKG - A,24200,6050,0,18150
2,3,16920,CHOSMIKA SREE LESHA ISUKAPUDI,LKG - A,24200,12100,0,12100
3,4,16938,JESWIKA RAGHUMANDA,LKG - A,24200,12100,0,12100
4,5,16932,MANASVEE DEVIREDDY,LKG - A,24200,12100,0,12100
...,...,...,...,...,...,...,...,...
1716,46,15872,SHANMUKH SALAPU,X - C,41800,31350,0,10450
1717,47,15741,SIVA HARSHA VELAMAREDDI,X - C,41800,20900,0,20900
1718,48,13863,UPENDRA MUTCHI,X - C,41800,10450,0,31350
1719,49,14360,VARUN PRESINGI,X - C,41800,10450,0,31350
1720,50,13796,VINAY PIDUGU,X - C,41800,10450,0,31350

### **Creating Terms**

In [128]:
df.columns

Index(['SNo', 'AdmissionNo', 'StudentName', 'Class & Sec', 'TotalFees',
       'TotalFeePaid', 'Discount/Concession', 'TotalDue'],
      dtype='object')

In [129]:
import pandas as pd

def calculate_terms(row):
    # Extract values from the row
    class_name = row['Class & Sec']
    total_paid = row['TotalFeePaid']
    total_fees = row['TotalFees']
    discount = row['Discount/Concession'] if pd.notnull(row['Discount/Concession']) else 0

    # Initialize term values
    term1 = 0
    term2 = 0
    term3 = 0
    term4 = 0

    # Calculate terms based on class type
    if class_name.startswith(("LKG - ", "UKG - ", "X - ")):
        # Logic for specific classes
        if total_paid >= total_fees / 4:
            term1 = total_fees / 4

        if total_paid > total_fees / 4:
            if total_paid >= total_fees / 2:
                term2 = total_fees / 4
            else:
                term2 = total_paid - total_fees / 4

        if total_paid > total_fees / 2:
            if total_paid >= 3 * total_fees / 4:
                term3 = total_fees / 4
            else:
                term3 = total_paid - total_fees / 2

        if total_paid > 3 * (total_fees / 4):
            term4 = (total_fees / 4) - discount

    else:
        # Logic for remaining classes with adjustments
        if total_paid >= (total_fees - 400) / 4:
            term1 = (total_fees - 400) / 4

        if total_paid > (total_fees - 400) / 4:
            if total_paid >= (2 * (total_fees - 400) / 4 + 400):
                term2 = (total_fees - 400) / 4 + 400
            else:
                term2 = total_paid - (total_fees - 400) / 4

        if total_paid > (2 * (total_fees - 400) / 4 + 400):
            if total_paid >= (3 * (total_fees - 400) / 4 + 400):
                term3 = (total_fees - 400) / 4
            else:
                term3 = total_paid - (2 * (total_fees - 400) / 4 + 400)

        if total_paid > (3 * (total_fees - 400) / 4 + 400):
            term4 = ((total_fees - 400) / 4) - discount

    # Cast term values to integers
    return int(term1), int(term2), int(term3), int(term4)


# Apply the calculate_terms function to each row and create new columns for terms
df[['Term1', 'Term2', 'Term3', 'Term4']] = df.apply(calculate_terms, axis=1, result_type='expand')

C:\Users\harik\AppData\Local\Temp\ipykernel_6668\1078126674.py:62: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Term1', 'Term2', 'Term3', 'Term4']] = df.apply(calculate_terms, axis=1, result_type='expand')
C:\Users\harik\AppData\Local\Temp\ipykernel_6668\1078126674.py:62: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Term1', 'Term2', 'Term3', 'Term4']] = df.apply(calculate_terms, axis=1, result_type='expand')
C:\Users\harik\AppData\Local\Temp\ipykernel_6668\1078126674.py:62: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Term1', 'Term2', 'Term3', 'Term4']] = df.apply(calculate_terms, axis=1, result_type='expand')
C:\Users\harik\AppData\Local\Temp\ipykernel_6668\1078126674.py:62: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Term1', 'Term2', 'Term3', 'Term4']] = df.apply(calculate_terms, axis=1, result_type='expand')

In [130]:
df.columns

Index(['SNo', 'AdmissionNo', 'StudentName', 'Class & Sec', 'TotalFees',
       'TotalFeePaid', 'Discount/Concession', 'TotalDue', 'Term1', 'Term2',
       'Term3', 'Term4'],
      dtype='object')

In [131]:
df = df[['SNo', 'StudentName', 'AdmissionNo',  'Class & Sec', 'Term1', 'Term2','Term3', 'Term4','TotalFeePaid', 'Discount/Concession', 'TotalDue']]

In [132]:
df

,SNo,StudentName,AdmissionNo,Class & Sec,Term1,Term2,Term3,Term4,TotalFeePaid,Discount/Concession,TotalDue
0,1,BHASHVIKA AKULA,16922,LKG - A,6050,6050,0,0,12100,0,12100
1,2,BHAVITHA SRI PANDRANKI,17103,LKG - A,6050,0,0,0,6050,0,18150
2,3,CHOSMIKA SREE LESHA ISUKAPUDI,16920,LKG - A,6050,6050,0,0,12100,0,12100
3,4,JESWIKA RAGHUMANDA,16938,LKG - A,6050,6050,0,0,12100,0,12100
4,5,MANASVEE DEVIREDDY,16932,LKG - A,6050,6050,0,0,12100,0,12100
...,...,...,...,...,...,...,...,...,...,...,...
1716,46,SHANMUKH SALAPU,15872,X - C,10450,10450,10450,0,31350,0,10450
1717,47,SIVA HARSHA VELAMAREDDI,15741,X - C,10450,10450,0,0,20900,0,20900
1718,48,UPENDRA MUTCHI,13863,X - C,10450,0,0,0,10450,0,31350
1719,49,VARUN PRESINGI,14360,X - C,10450,0,0,0,10450,0,31350
1720,50,VINAY PIDUGU,13796,X - C,10450,0,0,0,10450,0,31350

In [133]:
# Replace zeros with blanks (empty strings)
df.replace(0, '', inplace=True)
df

C:\Users\harik\AppData\Local\Temp\ipykernel_6668\2437505253.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(0, '', inplace=True)
C:\Users\harik\AppData\Local\Temp\ipykernel_6668\2437505253.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.replace(0, '', inplace=True)

,SNo,StudentName,AdmissionNo,Class & Sec,Term1,Term2,Term3,Term4,TotalFeePaid,Discount/Concession,TotalDue
0,1,BHASHVIKA AKULA,16922,LKG - A,6050,6050,,,12100,,12100
1,2,BHAVITHA SRI PANDRANKI,17103,LKG - A,6050,,,,6050,,18150
2,3,CHOSMIKA SREE LESHA ISUKAPUDI,16920,LKG - A,6050,6050,,,12100,,12100
3,4,JESWIKA RAGHUMANDA,16938,LKG - A,6050,6050,,,12100,,12100
4,5,MANASVEE DEVIREDDY,16932,LKG - A,6050,6050,,,12100,,12100
...,...,...,...,...,...,...,...,...,...,...,...
1716,46,SHANMUKH SALAPU,15872,X - C,10450,10450,10450,,31350,,10450
1717,47,SIVA HARSHA VELAMAREDDI,15741,X - C,10450,10450,,,20900,,20900
1718,48,UPENDRA MUTCHI,13863,X - C,10450,,,,10450,,31350
1719,49,VARUN PRESINGI,14360,X - C,10450,,,,10450,,31350
1720,50,VINAY PIDUGU,13796,X - C,10450,,,,10450,,31350

In [134]:
df.to_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\FeesReport2024-25_cleaned.xlsx", index=False)

### **Combine Header and Data**

In [135]:
import openpyxl
from openpyxl.utils.dataframe import dataframe_to_rows
import pandas as pd
from openpyxl.styles import Alignment, Border, Side

# Load the cleaned data
cleaned_df = pd.read_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\FeesReport2024-25_cleaned.xlsx")

# Load the workbook with the header
wb = openpyxl.load_workbook(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\fee_details_header.xlsx")
ws = wb.active

# Define thin border style for table cells
thin_border = Border(left=Side(style='thin'), 
                     right=Side(style='thin'), 
                     top=Side(style='thin'), 
                     bottom=Side(style='thin'))

# Convert the cleaned data DataFrame to rows compatible with Openpyxl
rows = dataframe_to_rows(cleaned_df, index=False, header=False)

# Append the data below the header (starting at row 5 to match your previous code)
for r_idx, row in enumerate(rows, start=5):
    for c_idx, value in enumerate(row, start=1):
        cell = ws.cell(row=r_idx, column=c_idx, value=value)
        # Apply thin border to each cell
        cell.border = thin_border
        
        # Center align data in columns C to H
        if 3 <= c_idx <= 8:  # Columns C (3) to H (8)
            cell.alignment = Alignment(horizontal='center')

# Save the final workbook with the combined header and data
wb.save(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\Fees Report 2024-25.xlsx")

In [136]:
import pandas as pd
import openpyxl
from openpyxl.utils.dataframe import dataframe_to_rows
from openpyxl.styles import Font, Fill, Border, Alignment, Protection

# Load the cleaned data
cleaned_df = pd.read_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\FeesReport2024-25_cleaned.xlsx")

# Load the workbook with the header
wb = openpyxl.load_workbook(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\fee_details_header.xlsx")
original_ws = wb.active  # Assuming the original sheet is the active one

# Create a new workbook for each class and section
class_sections = cleaned_df['Class & Sec'].unique()

def copy_cell_style(original_cell, new_cell):
    """Copy cell styles from original_cell to new_cell."""
    # Copy font
    new_cell.font = Font(
        name=original_cell.font.name,
        size=original_cell.font.size,
        bold=original_cell.font.bold,
        italic=original_cell.font.italic,
        vertAlign=original_cell.font.vertAlign,
        underline=original_cell.font.underline,
        strike=original_cell.font.strike,
        color=original_cell.font.color
    )

    # Copy fill (background color)
    if original_cell.fill:
        new_cell.fill = original_cell.fill.copy()  # Create a copy of the fill style

    # Copy border
    if original_cell.border:
        new_cell.border = original_cell.border.copy()  # Create a copy of the border style

    # Copy alignment
    if original_cell.alignment:
        new_cell.alignment = Alignment(
            horizontal=original_cell.alignment.horizontal,
            vertical=original_cell.alignment.vertical,
            text_rotation=original_cell.alignment.text_rotation,
            wrap_text=original_cell.alignment.wrap_text,
            shrink_to_fit=original_cell.alignment.shrink_to_fit,
            indent=original_cell.alignment.indent
        )

    # Copy protection
    new_cell.protection = Protection(
        locked=original_cell.protection.locked,
        hidden=original_cell.protection.hidden
    )

for class_sec in class_sections:
    # Filter the DataFrame for the current class & sec
    class_df = cleaned_df[cleaned_df['Class & Sec'] == class_sec]

    # Create a new sheet in the workbook
    new_ws = wb.create_sheet(title=class_sec)

    # Copy header formatting from the original sheet to the new sheet
    for col in range(1, original_ws.max_column + 1):
        original_cell = original_ws.cell(row=1, column=col)
        new_cell = new_ws.cell(row=1, column=col)
        new_cell.value = original_cell.value
        
        # Copy formatting manually
        copy_cell_style(original_cell, new_cell)

    # Append the class-specific data to the new sheet
    for r_idx, row in enumerate(dataframe_to_rows(class_df, index=False, header=False), start=2):
        for c_idx, value in enumerate(row, start=1):
            new_ws.cell(row=r_idx, column=c_idx, value=value)

# Save the workbook with the new sheets, including the original sheet
wb.save(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\Fees Report 2024-25_with_separated_sheets.xlsx")

C:\Users\harik\AppData\Local\Temp\ipykernel_6668\4042522609.py:32: DeprecationWarning: Call to deprecated function copy (Use copy(obj) or cell.obj = cell.obj + other).
  new_cell.fill = original_cell.fill.copy()  # Create a copy of the fill style
C:\Users\harik\AppData\Local\Temp\ipykernel_6668\4042522609.py:36: DeprecationWarning: Call to deprecated function copy (Use copy(obj) or cell.obj = cell.obj + other).
  new_cell.border = original_cell.border.copy()  # Create a copy of the border style

In [137]:
import pandas as pd

# Load the Excel file (update the path as needed)
df = pd.read_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\Fees Report 2024-25.xlsx")

# Define a function to update 'Permission upto' and 'Fine' based on 'Admission No'
def update_permission_fine(admission_no, permission_upto, fine):
    # Locate the row where the 'Admission No' matches
    df.loc[df['ADMISSION NO'] == admission_no, 'Permission upto'] = permission_upto
    df.loc[df['ADMISSION NO'] == admission_no, 'Fine'] = fine

# Example usage: Update for a specific admission number
#update_permission_fine(16922, 'August 2024', 0)
#update_permission_fine(17103, 'October 2024', 50)

# Save the updated DataFrame to the same or a new Excel file
#df.to_excel(r"I:\My Drive\Kotak Salesian School\2024-25\Fee Report 2024-25\PythonScript\Updated_FeesReport2024-25.xlsx", index=False)

print("File updated successfully.")

File updated successfully.